


#ifndef __MAIN_H
#define __MAIN_H

#include "eepromCtrl.h"
/*------------------------------------------------------------------------------
*************************************宏定义*************************************
------------------------------------------------------------------------------*/
//蜂鸣器
#define BUZZER_ON        //GPIO_WriteLow(GPIOB, GPIO_PIN_5) //蜂鸣器开宏定义
#define BUZZER_OFF       GPIO_WriteHigh(GPIOB, GPIO_PIN_5)//蜂鸣器关宏定义

/*------------------------------------------------------------------------------
********************************* 结构体 定义 **********************************
------------------------------------------------------------------------------*/
//控制标志位定义(u8 类型，改成位段，eep需改)
typedef struct
{
    u8 flgRun;    //总运行标志
    u8 Mute;      //按键消音标志位
}
Control_FlagInit;
extern Control_FlagInit CtrlFlag;

//参数表三
typedef struct
{
    u16 rST;
}
PARATHREE;

//参数表四
typedef struct
{
    u16 AT;
}
PARAFOUR;

extern PARATHREE m_para3;
extern PARAFOUR  m_para4;
/*------------------------------------------------------------------------------
*********************************** 变量声明 ***********************************
------------------------------------------------------------------------------*/
//时间变量
extern u8  TimS_PowerOn;  //上电4秒钟计时
extern u16 TimMs_SpeakPowerOn;//上电状态蜂鸣器计时

extern u8 TimS_BuzzFlash;

#endif
